### Part 3 
*Construct and export a MySQL database using your data.

In [1]:
import pandas as pd
import os, time,json
import tmdbsimple as tmdb
from tqdm.notebook import tqdm_notebook

from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()

In [2]:
import json
with open('/Users/christinab/.secret/tmdb_api.json', 'r') as f:
    login=json.load(f)
# display the keys of the loaded dictionary 
login.keys()

dict_keys(['client-id', 'Api-key'])

In [3]:
#make a movie object using the .Movies function from tmdb
tmdb.API_Key = login['Api-key']

### Normalizing Genres

In [4]:
# import the cleaned basics table
basics=pd.read_csv('In_progress/Data/title_basics_cleaned_1.csv.gz')
basics.head()

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama
3,tt0079644,movie,November 1828,November 1828,0,2001,NaN,140,"Drama,War"
4,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005,NaN,100,"Comedy,Horror,Sci-Fi"

In [5]:
# create a col with a list of genres
basics['genres_split'] = basics['genres'].str.split(',')
basics.head(3)

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance","[Comedy, Fantasy, Romance]"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,[Drama]
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,[Drama]

In [6]:
# use explode to separate the single list 
exploded_genres = basics.explode('genres_split')
exploded_genres

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres,genres_split
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Comedy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Fantasy
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001,NaN,118,"Comedy,Fantasy,Romance",Romance
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El Tango del Viudo y Su Espejo Deformante,0,2020,NaN,70,Drama,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018,NaN,122,Drama,Drama
...,...,...,...,...,...,...,...,...,...,...
144745,tt9916190,movie,Safeguard,Safeguard,0,2020,NaN,95,"Action,Adventure,Thriller",Thriller
144746,tt9916270,movie,Il talento del calabrone,Il talento del calabrone,0,2020,NaN,84,Thriller,Thriller
144747,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",Drama
144747,tt9916362,movie,Coven,Akelarre,0,2020,NaN,92,"Drama,History",History
144748,tt9916538,movie,Kuambil Lagi Hatiku,Kuambil Lagi Hatiku,0,2019,NaN,123,Drama,Drama

In [7]:
# Get the string column converted to a list of strings in each row
genres_split = basics['genres'].str.split(',')

## Explore the series using.explore() and take the .unique() entires only.
unique_genres = genres_split.explode().unique()
unique_genres

array(['Comedy', 'Fantasy', 'Romance', 'Drama', 'War', 'Horror', 'Sci-Fi',
       'Mystery', 'Adventure', 'Musical', 'Action', 'Crime', 'Thriller',
       'Music', 'Animation', 'Family', 'History', 'Biography', 'Sport',
       'Western', 'Adult', 'Short', 'Reality-TV', 'News', 'Talk-Show',
       'Game-Show'], dtype=object)

In [8]:
# use the unique genres from the genres_split colummn 
unique_genres = sorted(exploded_genres['genres_split'].unique())

In [9]:
# create a new title_genres table with only the 'tconst & genres_split' columns
# save as a new df

title_genres = exploded_genres[['tconst', 'genres_split']].copy()
title_genres.head()

      tconst genres_split
0  tt0035423       Comedy
0  tt0035423      Fantasy
0  tt0035423      Romance
1  tt0062336        Drama
2  tt0069049        Drama

In [10]:
## Making the genre mapper dictionary
genre_ints = range(len(unique_genres))
genre_map = dict(zip(unique_genres, genre_ints))
genre_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [11]:
# Make a dictionary with list of unique genres as the key and the new interger id as values
genre_id_map = dict(zip(unique_genres, range(len(unique_genres))))
genre_id_map

{'Action': 0,
 'Adult': 1,
 'Adventure': 2,
 'Animation': 3,
 'Biography': 4,
 'Comedy': 5,
 'Crime': 6,
 'Drama': 7,
 'Family': 8,
 'Fantasy': 9,
 'Game-Show': 10,
 'History': 11,
 'Horror': 12,
 'Music': 13,
 'Musical': 14,
 'Mystery': 15,
 'News': 16,
 'Reality-TV': 17,
 'Romance': 18,
 'Sci-Fi': 19,
 'Short': 20,
 'Sport': 21,
 'Talk-Show': 22,
 'Thriller': 23,
 'War': 24,
 'Western': 25}

In [12]:
## create a new genre_id column using the genre_map dictionary with either .map or .replace.

## make new integer genre_id and drop string genres
basics['genre_id'] = basics['genres'].map(genre_map)
basics = basics.drop(columns='genres')

In [13]:
## Manaully make dataframe with named cols from the .keyd and .values
genre_lookup = pd.DataFrame({'Genre_Name': genre_id_map.keys(),
                            'Genre_ID': genre_id_map.values()})
genre_lookup.head()

  Genre_Name  Genre_ID
0     Action         0
1      Adult         1
2  Adventure         2
3  Animation         3
4  Biography         4

### Saving tables to SQL

In [14]:
## loading mysql credentials 
from sqlalchemy import create_engine
import pymysql
pymysql.install_as_MySQLdb()
from sqlalchemy_utils import create_database, database_exists

from urllib.parse import quote_plus as urlquote
import json 

with open('/Users/christinab/.secret/mysql.json') as f: 
    login=json.load(f)

login.keys()

dict_keys(['username', 'password'])

In [15]:
# connect engine 
connection = f"mysql+pymysql://{login['username']}:{urlquote(login['password'])}@localhost/movies_sql"
engine = create_engine(connection)

In [16]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created.')

It exists!

In [17]:
## Example
from sqlalchemy.types import *
## Calculate max string lengths for object columns
key_len = basics['tconst'].fillna('').map(len).max()
title_len = basics['primaryTitle'].fillna('').map(len).max()
## Create a schema dictonary using Sqlalchemy datatype objects
basics_schema = {
    "tconst": String(key_len+1), 
    "primaryTitle": Text(title_len+1),
    'startYear':Float(),
    'endYear':Float(),
    'runtimeMinutes':Integer()}

In [18]:
# drop non-essential columns
basics = basics.drop(columns=['genres_split', 'originalTitle', 'isAdult', 'genre_id', 'titleType'])

In [19]:
# Save to sql with dtype and index=False (basics dataframe)
basics.to_sql('title_basics',engine,dtype=basics_schema,if_exists='replace',index=False)

144749

In [20]:
# Save to sql with dtype and index=False (title dataframe)
title_genres.to_sql('title_genres', engine,dtype=basics_schema,if_exists='replace', index=False)

250934

In [21]:
# Save to sql with dtype and index=False (genre_lookup)
genre_lookup.to_sql('genres', engine,dtype=basics_schema,if_exists='replace', index=False)

26

In [22]:
ratings= pd.read_csv('In_progress/title_ratings_cleaned.csv.gz')
ratings

           tconst  averageRating  numVotes
0       tt0000001            5.7      1879
1       tt0000002            5.9       248
2       tt0000005            6.2      2476
3       tt0000006            5.2       165
4       tt0000007            5.4       771
...           ...            ...       ...
469800  tt9916204            8.2       224
469801  tt9916348            8.5        17
469802  tt9916362            6.4      4613
469803  tt9916428            3.6        15
469804  tt9916720            5.1       210

[469805 rows x 3 columns]

In [23]:
# Save to sql with dtype and index=False (ratings dataframe)
ratings.to_sql('ratings', engine,dtype=basics_schema,if_exists='replace', index=False)

469805

In [24]:
tmdb = pd.read_csv('In_progress/Data/final_tmdb_data_[2000, 2001].csv.gz')
tmdb

   imdb_id
0        0

In [25]:
# Save to sql with dtype and index=False (ratings dataframe)
tmdb.to_sql('tmdb', engine,dtype=basics_schema,if_exists='replace', index=False)

1

In [26]:
q= '''SHOW TABLES'''
pd.read_sql(q, engine)

  Tables_in_movies_sql
0               genres
1              ratings
2         title_basics
3         title_genres
4                 tmdb

In [27]:
q= '''SELECT * FROM title_basics'''
pd.read_sql(q, engine)

,tconst,primaryTitle,startYear,endYear,runtimeMinutes
0,tt0035423,Kate & Leopold,2001.0,None,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,None,70
2,tt0069049,The Other Side of the Wind,2018.0,None,122
3,tt0079644,November 1828,2001.0,None,140
4,tt0088751,The Naked Monster,2005.0,None,100
...,...,...,...,...,...
144744,tt9916170,The Rehearsal,2019.0,None,51
144745,tt9916190,Safeguard,2020.0,None,95
144746,tt9916270,Il talento del calabrone,2020.0,None,84
144747,tt9916362,Coven,2020.0,None,92
144748,tt9916538,Kuambil Lagi Hatiku,2019.0,None,123

In [28]:
engine.execute("ALTER TABLE title_basics ADD PRIMARY KEY (`tconst`);")